# -*- coding: utf-8 -*-


'''
# 大众点评上的url里的代码
'''
from ..settings import DISTRICT_LEVEL


# 上海市区县代码
district = {
    '静安区': 'r3', '长宁区': 'r4', '徐汇区': 'r2', '杨浦区': 'r10', 
    '黄浦区': 'r6', '虹口区': 'r9', '普陀区': 'r7', '闵行区': 'r12', 
    '宝山区': 'r13', '浦东新区': 'r5', '松江区': 'r5937', '嘉定区': 'r5938', 
    '青浦区': 'r5939', '金山区': 'r8847', '奉贤区': 'r8846', '崇明区': 'c3580'
    }

# 浦东
pudong = {
    '陆家嘴': 'r801',
    '世纪公园': 'r803',
    '八佰伴': 'r802',
    '金桥': 'r806',
    '塘桥': 'r809',
    '上南地区': 'r804',
    '张江': 'r808',
    '源深体育中心': 'r807',
    '世博源': 'r67275',
    '临沂/南码头': 'r8446',
    '康桥/周浦': 'r5947',
    '金杨地区': 'r2869',
    '碧云社区': 'r2868',
    '川沙': 'r810',
    '三林地区': 'r2867',
    '曹路': 'r22948',
    '北蔡': 'r12029',
    '外高桥': 'r805',
    '惠南镇': 'r5948',
    '三林镇': 'r22947',
    '新场': 'r24017',
    '世纪大道': 'r70602',
    '迪士尼': 'r70265',
    '高行': 'r24141',
    '东明': 'r8929', 
    '南汇新城': 'r24020', 
    '泥城': 'r24018', 
    '浦东机场': 'r9179', 
    '祝桥': 'r70326', 
    '唐镇': 'r81213', 
    '航头': 'r24024'
    }

# 闵行
minhang = {
    '龙柏地区': 'r2528', 
    '虹桥镇': 'r846', 
    '虹桥枢纽': 'r70507', 
    '莘庄': 'r849', 
    '七宝': 'r848', 
    '老闵行': 'r852', 
    '南方商城': 'r850', 
    '浦江镇': 'r8928', 
    '莘庄龙之梦': 'r8597', 
    '虹梅路': 'r847', 
    '仲盛商业中心': 'r982', 
    '万源城/东兰路': 'r853', 
    '春申地区': 'r851', 
    '吴泾': 'r22955', 
    '颛桥': 'r22953', 
    '华漕': 'r22952', 
    '龙胜国际商业广场': 'r67276', 
    '好爱广场': 'r22957', 
    '交大闵行校区': 'r22956', 
    '北桥': 'r22954', 
    '金平路步行街': 'r22958', 
    '塘湾镇/曹行镇': 'r88597'
    }

# 嘉定
jiading = {
    '嘉定镇': 'r5946', 
    '南翔': 'r5944', 
    '安亭': 'r5945', 
    '江桥': 'r5962', 
    '马陆': 'r22991', 
    '丰庄': 'r22988', 
    '嘉定新城': 'r27830', 
    '罗宾森广场': 'r22989', 
    '博乐广场': 'r22990', 
    '新源路': 'r22992', 
    '黄渡': 'r24022', 
    '戬浜': 'r24021', 
    '外冈': 'r65166', 
    '华亭镇': 'r88590',        # 宝山
    '封浜镇': 'r88594', 
    '嘉定西/优活城': 'r88592', 
    '陆渡镇': 'r71499'
    }

# 松江
songjiang = {
    '松江大学城': 'r5941', 
    '开元地中海': 'r22979', 
    '松江万达': 'r26146', 
    '鹿都国际商业广场': 'r24019', 
    '松江镇': 'r5940', 
    '九亭': 'r5943', 
    '中山中路': 'r22983', 
    '佘山': 'r5942', 
    '新松江图': 'r22987', 
    '泰晤士小镇': 'r22986', 
    '松东路': 'r22980', 
    '新桥': 'r11374', 
    '江学路': 'r22981', 
    '泗泾': 'r9178', 
    '新理想广场': 'r70277', 
    '嘉和广场': 'r67354', 
    '荣乐中路': 'r22982', 
    '飞航广场': 'r22985', 
    '人民北路': 'r22984', 
    '车墩影视城': 'r88599', 
    '欢乐谷': 'r88598', 
    '叶榭镇': 'r88600', 
    }

# 青浦
qingpu = {
    '朱家角': 'r5949', 
    '青浦城区': 'r22993', 
    '徐泾': 'r30340', 
    '赵巷': 'r22995', 
    '华新': 'r24023', 
    '上海国家会展中心': 'r70209', 
    '重固': 'r22994', 
    }

# 金山
jinshan = {
    '金山万达': 'r65207', 
    '枫泾': 'r22974', 
    '金山卫': 'r9174', 
    '朱泾': 'r22970', 
    '卫清路': 'r22968', 
    '金山嘴': 'r22969', 
    '石化': 'r22971',
    '卫零路': 'r22966', 
    '亭林': 'r22975',
    '金山新城': 'r22972', 
    '蒙山路': 'r22967',
    '朱行': 'r22973', 
    '廊下': 'r66226', 
    }

# 奉贤
fengxian = {
    '海湾旅游区': 'r24025', 
    '百联南桥购物中心': 'r22961', 
    '南桥': 'r9172', 
    '环城东路': 'r22959', 
    '新都汇': 'r22964', 
    '易买得': 'r22960', 
    '西渡': 'r9173', 
    '环城南路': 'r22962', 
    '南桥新城区': 'r22965', 
    '奉城镇': 'r66320', 
    '正阳世纪新城': 'r22963', 
    '金汇镇': 'r66319', 
    '拓林镇': 'r88596', 
    '庄行镇': 'r88595',
    }

# 静安
jingan = {
    '静安寺': 'r812', 
    '南京西路': 'r811', 
    '闸北公园': 'r830', 
    '火车站': 'r827', 
    '大宁地区': 'r828', 
    '同乐坊': 'r814', 
    '曹家渡': 'r813', 
    '彭浦新村': 'r829', 
    '大悦城': 'r12026', 
    '市北工业园/汶水路': 'r22950',
    '西藏北路/中兴路': 'r22949', 
    '北区汽车站': 'r2864', 
    '彭浦镇': 'r22951', 
    '高行': 'r88867',         # 普陀
    }

# 长宁
changning = {
    '中山公园': 'r842', 
    '古北': 'r841',       # 闵行
    '天山': 'r840', 
    '虹桥': 'r839',       # 闵行
    '北新泾': 'r845', 
    '上海影城/新华路': 'r843', 
    '动物园/虹桥机场': 'r844', 
    }

# 徐汇
xuhui = {
    '徐家汇': 'r865', 
    '漕河泾/田林': 'r872', 
    '音乐学院': 'r870', 
    '龙华': 'r871', 
    '肇嘉浜路沿线': 'r869', 
    '上海南站': 'r873', 
    '万体馆': 'r866', 
    '复兴西路/丁香花园': 'r868', 
    '衡山路': 'r867', 
    '光启城': 'r4031',
    }

#杨浦
yangpu = {
    '五角场/大学城': 'r854', 
    '中原地区': 'r856', 
    '控江地区': 'r855', 
    '鞍山新村': 'r8445', 
    '平凉路': 'r858', 
    '黄兴公园': 'r857', 
    '新江湾城': 'r85102', 
    '大连路地铁站': 'r85128',     # 虹口
    }


# 黄浦
huangpu = {
    '打浦桥': 'r838', 
    '新天地': 'r836', 
    '南京东路': 'r861', 
    '淮海路': 'r835', 
    '人民广场': 'r860', 
    '外滩': 'r859', 
    '瑞金宾馆区': 'r837', 
    '老西门': 'r863', 
    '董家渡': 'r864', 
    '城隍庙': 'r862', 
    '西藏南路/世博会馆': 'r88601', 
    }

# 虹口区
hongkou = {
    '临平路/和平公园': 'r824', 
    '四川北路': 'r822', 
    '虹口足球场': 'r821', 
    '曲阳地区': 'r820', 
    '北外滩': 'r825', 
    '凉城/江湾镇': 'r826', 
    '赤峰路': 'r22946', 
    '海宁路/七浦路': 'r823', 
    }

# 普陀区
putuo = {
    '长寿路': 'r815', 
    '月新环球港': 'r9177', 
    '中山北路/甘泉地区': 'r819', 
    '梅川路': 'r818', 
    '长风公园/华师大': 'r816', 
    '武宁地区': 'r2866', 
    '曹阳地区': 'r817', 
    '真如': 'r2865', 
    '桃浦': 'r12038', 
    }

# 宝山区
baoshan = {
    '宝山城区': 'r8440', 
    '大华地区': 'r831', 
    '庙行/共康': 'r834', 
    '通河/泗塘': 'r8441', 
    '顾村公园': 'r8442', 
    '淞滨地区': 'r833', 
    '高境': 'r9170', 
    '月浦': 'r8444', 
    '美兰湖': 'r8443', 
    '上海大学': 'r2527', 
    '淞南': 'r9171', 
    '杨行': 'r9169', 
    }


# 崇明
chongming = {
    '堡镇': 'r64598', 
    '陈桥镇': 'r64597', 
    '庙镇': 'r64600', 
    '竖新镇': 'r64601', 
    '陈家镇': 'r64606', 
    '新河镇': 'r64599', 
    '向化镇': 'r64602', 
    '长兴镇': 'r64612', 
    '沿港镇': 'r64604', 
    '中兴镇': 'r64605', 
    '建设镇': 'r64609', 
    '东平镇': 'r64611', 
    '横沙乡': 'r64614', 
    '崇明区其他': 'r8848', 
    }


# 食物分类代码
foodType = {
    '本帮江浙菜': 'g101', 
    '日本菜': 'g113', 
    '小吃快餐': 'g112', 
    '面包甜点': 'g117', 
    '火锅': 'g110', 
    '西餐': 'g116', 
    '自助餐': 'g111', 
    '粤菜': 'g103', 
    '韩国料理': 'g114', 
    '小龙虾': 'g219', 
    '烧烤': 'g508', 
    '下午茶': 'g34014', 
    '川菜': 'g102', 
    '其他美食': 'g118', 
    '东南亚菜': 'g115', 
    '面馆': 'g215', 
    '海鲜': 'g251', 
    '素菜': 'g109', 
    '人气餐厅': 'g34032', 
    '湘菜': 'g104', 
    '新疆菜': 'g3243', 
    '东北菜': 'g106', 
    '早茶': 'g34055', 
    'Brunch': 'g34015', 
    '云南菜': 'g248', 
    '蟹宴': 'g203', 
    '烤鱼': 'g4473', 
    '台湾菜': 'g107', 
    '西北菜': 'g26481', 
    '农家菜': 'g25474', 
    '北京菜': 'g311', 
    '贵州菜': 'g105', 
    '江西菜': 'g247', 
    '水果生鲜': 'g2714', 
    '家常菜':'g1783', 
    '食品保健': 'g33759', 
    '饮品店': 'g34236'
    }


def genAreaCode(include=False):
    group = [
        [changning, xuhui, yangpu, huangpu, hongkou, putuo, minhang, baoshan, pudong, jingan, ],
        [songjiang, jiading, qingpu, jinshan, fengxian],
        [chongming]
        ]
    if include:
        # 包含模式(DISTRICT_LEVEL只代表最高组别,向下包含)
        AREA = []
        for i in range(DISTRICT_LEVEL):
            AREA.extend(group[i])
            for area in AREA:
                for k in area:
                    yield area[k]
    else:
        # 分组模式(DISTRICT_LEVEL只代表组别,不向下包含)
        AREA = group[DISTRICT_LEVEL-1]
        for area in AREA:
            for k in area:
                yield area[k]

def genTypeCode():
    for k in foodType:
        yield(foodType[k])

def genUrl():
    url = r'http://www.dianping.com/shanghai/ch10/'
#    AREA = genAreaCode(level)
#    TYPE = genTypeCode()    # 为啥用了AREA和TYPE两个变量之后，就不能正常完全迭代呢？
    for r in genAreaCode():
        for g in genTypeCode():
            yield url + r + g
    